# TooFewParamsForSketch Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..TooFewParamsForSketch Property
BuiltInFailures..::..SketchFailures Class See Also
---
The sketched Structural Rebar element has too many segments to be properly parameterized. Please reduce the number of segments.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId TooFewParamsForSketch { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TooFewParamsForSketch As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ TooFewParamsForSketch {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace